close all;
clear all;

%%erwtima A
syms z; % Ορίζουμε το σύμβολο z
H = (4 - 3.5 * z^-1) / (1 - 2.5 * z^-1 + z^-2); % Ορίζουμε τη συνάρτηση μεταφοράς

% Χρησιμοποιούμε τη συνάρτηση residuez για να βρούμε τους πόλους και τους συντελεστές των απλών κλασμάτων
[p, q] = residuez([4, -3.5, 0], [1, -2.5, 1]);

% Εκτυπώνουμε την αναλυτική έκφραση της H(z) σε απλά κλάσματα
H_as_frac = sum(q./(z-p)); % Συνολική αναλυτική έκφραση
pretty(H_as_frac); % Εμφανίζουμε το αποτέλεσμα με όμορφη μορφοποίηση

%%erwtima B
syms n z

% Ορίσαμε τους συντελεστές A και B
A = 1;
B = 2;

% Ορίσαμε τη συνάρτηση μεταφοράς H(z)
Hz = A / (1 - 0.9 * z^-1) + B / (1 + 0.2 * z^-1);

% Χρησιμοποιήσαμε την iztrans για να βρούμε τον αντίστροφο μετασχηματισμό
h = iztrans(Hz, z, n);

pretty(h);